function solution(sequence, k) {
  let start = 0;
  let sum = 0;
  let result = [0, sequence.length];

  for (let end = 0; end < sequence.length; end++) {
    sum += sequence[end];

    while (sum > k) {
      sum -= sequence[start];
      start++;
    }

    if (sum === k && end - start < result[1] - result[0]) {
      result = [start, end];
    }
  }
  return result;
}

// 정확성  테스트
// 테스트 1 〉	통과 (0.07ms, 43.6MB)
// 테스트 2 〉	통과 (0.08ms, 43.6MB)
// 테스트 3 〉	통과 (0.11ms, 43.3MB)
// 테스트 4 〉	통과 (0.16ms, 43.5MB)
// 테스트 5 〉	통과 (0.70ms, 49.1MB)
// 테스트 6 〉	통과 (0.54ms, 49.2MB)
// 테스트 7 〉	통과 (0.97ms, 49.6MB)
// 테스트 8 〉	통과 (2.48ms, 51.2MB)
// 테스트 9 〉	통과 (20.06ms, 53.7MB)
// 테스트 10 〉	통과 (13.74ms, 61.3MB)
// 테스트 11 〉	통과 (5.78ms, 75.4MB)
// 테스트 12 〉	통과 (5.12ms, 75.7MB)
// 테스트 13 〉	통과 (5.57ms, 75.7MB)
// 테스트 14 〉	통과 (5.41ms, 75.4MB)
// 테스트 15 〉	통과 (5.98ms, 75.5MB)
// 테스트 16 〉	통과 (3.02ms, 81.3MB)
// 테스트 17 〉	통과 (6.55ms, 81.2MB)
// 테스트 18 〉	통과 (0.08ms, 43.6MB)
// 테스트 19 〉	통과 (0.08ms, 43.4MB)
// 테스트 20 〉	통과 (0.09ms, 43.6MB)
// 테스트 21 〉	통과 (0.10ms, 43.5MB)
// 테스트 22 〉	통과 (0.11ms, 43.4MB)
// 테스트 23 〉	통과 (0.09ms, 43.6MB)
// 테스트 24 〉	통과 (5.43ms, 73.7MB)
// 테스트 25 〉	통과 (3.26ms, 73.2MB)
// 테스트 26 〉	통과 (6.02ms, 73.4MB)
// 테스트 27 〉	통과 (9.29ms, 73.7MB)
// 테스트 28 〉	통과 (4.71ms, 73.3MB)
// 테스트 29 〉	통과 (4.38ms, 73.6MB)
// 테스트 30 〉	통과 (6.30ms, 81.1MB)
// 테스트 31 〉	통과 (0.07ms, 43.7MB)
// 테스트 32 〉	통과 (0.07ms, 43.5MB)
// 테스트 33 〉	통과 (0.07ms, 43.5MB)
// 테스트 34 〉	통과 (0.07ms, 43.4MB)
// 채점 결과
// 정확성: 100.0
// 합계: 100.0 / 100.0
